snlkuharlocal/src/Documents/КорректировочныйСчетФактура/КорректировочныйСчетФактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировочныйСчетФактура</name>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <basedOn>Document.КорректировкаЦенВНакладной</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСовсемБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСпособаВыставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКСФВходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКСФВходящий</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.КорректировкаЦенВНакладной</types>
        <types>DocumentRef.РекламационнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСовсемБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЧека</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЗадолженности</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЦенВНакладной</types>
        <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
        <types>DocumentRef.ОплатаПлатежнойКартой</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежноРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСчетаФактурыПродавца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСДоКорректировки</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорректируемыйСчетФактура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>(Общ) Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипСклада/ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСклада</name>
  <enumValues>
    <name>ОптовыйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>РозничныйТЦ</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>КБСтиль</name>
  </enumValues>
  <enumValues>
    <name>SNL</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСклад</name>
  </enumValues>
  <enumValues>
    <name>ВнешнийСкладРезерв</name>
  </enumValues>
  <enumValues>
    <name>ПалетноеХранение</name>
  </enumValues>
  <enumValues>
    <name>СкладВозвратов</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйСклад</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
  <enumValues>
    <name>Перепаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/КорректировочныйСчетФактура/ObjectModule.bsl
Функция ПолучитьКонтрагентаСклада(Склад)
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект",Склад);
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Контрагент получатель"));
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;
	КонецЦикла; 
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
КонецФункции //ПолучитьКонтрагентаСклада(Склад)

Процедура РасчетСтроки(СтрокаТЧ) Экспорт
	СтрокаТЧ.СуммаБезНДС18		=0;
	СтрокаТЧ.НДС18				=0;
	СтрокаТЧ.СуммаБезНДС10		=0;
	СтрокаТЧ.НДС10				=0;
	СтрокаТЧ.СуммаСовсемБезНДС	=0;
	
	Если СтрокаТЧ.Накладная<>Неопределено И НЕ СтрокаТЧ.Накладная.Пустая() Тогда
		ТабСтавок=СтрокаТЧ.Накладная.Товары.Выгрузить();
		ТабСтавок.Свернуть("СтавкаНДС","Всего,НДС");	
		
		СтрокаТЧ.Всего=ТабСтавок.Итог("Всего");		
		
		Для Каждого СтрокаСтавок Из ТабСтавок Цикл
			//крохин начало 08.01.2019
			//Если СтрокаСтавок.СтавкаНДС	= Перечисления.СтавкиНДС.НДС18 Тогда
			Если СтрокаСтавок.СтавкаНДС	= Перечисления.СтавкиНДС.НДС18 ИЛИ СтрокаСтавок.СтавкаНДС	= Перечисления.СтавкиНДС.НДС20 Тогда
			//крохин конец 08.01.2019	
				СтрокаТЧ.СуммаБезНДС18	= СтрокаСтавок.Всего-СтрокаСтавок.НДС;								
				СтрокаТЧ.НДС18			= СтрокаСтавок.НДС;			
			ИначеЕсли СтрокаСтавок.СтавкаНДС=Перечисления.СтавкиНДС.НДС10 Тогда
				СтрокаТЧ.СуммаБезНДС10	= СтрокаСтавок.Всего-СтрокаСтавок.НДС;								
				СтрокаТЧ.НДС10			= СтрокаСтавок.НДС;
			//крохин начало 15.02.2019	
		//ИначеЕсли СтрокаСтавок.СтавкаНДС= Перечисления.СтавкиНДС.БезНДС Тогда
		//для иностранцев
		ИначеЕсли СтрокаСтавок.СтавкаНДС= Перечисления.СтавкиНДС.БезНДС ИЛИ СтрокаСтавок.СтавкаНДС= Перечисления.СтавкиНДС.НДС0 Тогда
		//крохин конец 15.02.2019
				СтрокаТЧ.СуммаСовсемБезНДС	= СтрокаСтавок.Всего;			
			КонецЕсли;			
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Функция КонтрольДублейСФ(СФОбъект,Отказ,Дубли=Неопределено) Экспорт	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК СФ,
	|	Накладная
	|ИЗ
	|	Документ.КорректировочныйСчетФактура.Накладные КАК СчетФактураНакладные
	|ГДЕ
	|	Накладная В(&Накладные)
	|	И НЕ Ссылка.ПометкаУдаления
	|	И Ссылка <> &Ссылка
	|	И Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Накладные",СФОбъект.Накладные.ВыгрузитьКолонку("Накладная"));
	Запрос.УстановитьПараметр("Ссылка",СФОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация",СФОбъект.Организация);
	
	ЕстьДубли=Ложь;	
	
	Дубли=Новый Массив;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить("На корректирующий документ: "+Выборка.Накладная+", по организации: """+СФОбъект.Организация+"""
		|	уже выписана КСФ: "+Выборка.СФ,СтатусСообщения.Важное);		
		ЕстьДубли=Истина;	
		
		Дубли.Добавить(Выборка.СФ);
	КонецЦикла;
	
	Если НЕ Отказ И ЕстьДубли Тогда
		Отказ=Истина;
	КонецЕсли;	
	
	Возврат НЕ ЕстьДубли;
КонецФункции //КонтрольДублейСФ(СФОбъект,Отказ)

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	//// проверим, если проводят, а исходный документ ( ркм кнц, не проведен, отказать в проведении).
	//если РежимЗаписи=РежимЗаписиДокумента.Проведение и НЕ накладные[0].накладная.Проведен   Тогда
	//		Сообщить("Документ основание не проведен! Проведите документ основание");
	//		Отказ=истина;
	//		возврат;
	//КонецЕсли;
	//
	//если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения и накладные[0].накладная.Проведен Тогда
	//		Сообщить("Документ основание проведен! Распроведите документ основание");
	//		Отказ=истина;
	//		возврат;
	//КонецЕсли;
	//	
	//
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	
	// проверим
	//Кухарь 20.09.16 начало
	//При загрузке не нужно
	//Если ЭтоНовый() Тогда
	Если ЭтоНовый() и не ОбменДанными.Загрузка Тогда	
		//Кухарь 20.09.16 конец

		ДокРНк=ЭтотОбъект.Накладные[0].Накладная.ДокОснование.ссылка; 
		Запрос= Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	СчетФактураНакладные.Ссылка
		               |ИЗ
		               |	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
		               |ГДЕ
		               |	СчетФактураНакладные.Накладная = &ТекДок
		               |	И СчетФактураНакладные.Ссылка.Проведен = ИСТИНА";
		запрос.УстановитьПараметр("ТекДок",ДокРНК);			   
		Рез = Запрос.Выполнить().Выбрать();
		Если ДокументОснование= документы.РасходнаяНакладная.ПустаяСсылка() Тогда
			ДокументОснование = ДокРНК;
		КонецЕсли;	
			
		Если рез.Количество()= 0 Тогда
			сообщить("Не создана СФ, к документу РНК! КСФ создать не возможно.");
			возврат;
		КонецЕсли;
    КонецЕсли;	
	
	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			//Отказ=НЕ ПолучитьПолномочиеПользователя("ВыпискаСФвОфисе");
			Если Отказ Тогда
				Сообщить("Недостаточно полномочий для оформления СФ в офисной базе !",СтатусСообщения.Важное);			
			КонецЕсли;		
		КонецЕсли;
		
		//крохин начало 16.02.2012
		//запретим редактировать филиальные СФ в офисе и офисные - в филиале
		Если  НЕ ОбменДанными.Загрузка Тогда
			Если ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
				Если Склад.ТипСклада = Перечисления.ТипСклада.Филиал ИЛИ Склад.ТипСклада = Перечисления.ТипСклада.ОптовыйТЦ Тогда
					#Если КЛИЕНТ Тогда
						сообщить("КСФ по складу "+Склад + " редактируются только в соответствующем подразделении");
					#КОНЕЦЕСЛИ	
					Отказ = Истина;	
					
				КонецЕсли;
			ИначеЕсли ПараметрыСеанса.ЭтотУзел.ТипУзла=Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
				//крохин начало 11.04.2013
				//СФ можно редактировать только свои
				//Если Склад.ТипСклада <> Перечисления.ТипСклада.Филиал И Склад.ТипСклада <> Перечисления.ТипСклада.ОптовыйТЦ Тогда
				Если Склад.Подразделение <> ПараметрыСеанса.ЭтотУзел.Подразделение Тогда
					//крохин конец 11.04.2013
					#Если КЛИЕНТ Тогда
						сообщить("КСФ по складу "+Склад + " редактируются только в офисе");
					#КОНЕЦЕСЛИ	
					Отказ = Истина;	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		//крохин конец 16.02.2012
		
		//нечаева 24,11,16+++
	//	КонтрольДатыЗапрета(ЭтотОбъект,Отказ); 
		//нечаева 24,11,16--- не контролируем для КСФ
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		КонтрольДублейСФ(ЭтотОбъект,Отказ);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	Если ЕстьИзменения Тогда		
		СуммаБезНДС18		=Накладные.Итог("СуммаБезНДС18");
		НДС18				=Накладные.Итог("НДС18");
		СуммаБезНДС10		=Накладные.Итог("СуммаБезНДС10");
		НДС10				=Накладные.Итог("НДС10");
		СуммаСовсемБезНДС	=Накладные.Итог("СуммаСовсемБезНДС");
		Всего				=СуммаБезНДС18+НДС18+СуммаБезНДС10+НДС10+СуммаСовсемБезНДС;
		
		Для Каждого СтрокаТЧ Из Накладные Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Накладная.Номер) Тогда
				Если СтрокаТЧ.Накладная.Метаданные().Имя="Перемещение" Тогда
					Контрагент=ПолучитьКонтрагентаСклада(СтрокаТЧ.Накладная.СкладПолучатель);						
				Иначе
					Контрагент=СтрокаТЧ.Накладная.Корреспондент;
				КонецЕсли;		
				
				Прервать;			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ ОбменДанными.Загрузка Тогда
		Для Каждого СтрокаНакладной Из Накладные Цикл
			Накладная=СтрокаНакладной.Накладная;
			
		КонецЦикла; 				
	КонецЕсли;
	
	//нечаева 12,12,16++  не меняем  больше
	//Для Каждого СтрокаНакладной Из Накладные Цикл
	//	Накладная=СтрокаНакладной.Накладная.ДокОснование; // для РНК ставим этот статус
	//	Если Накладная<>Неопределено И ЕстьРеквизитДокумента("СостояниеДокументов",Накладная.Метаданные()) Тогда
	//		НакладнаяОбъект = Накладная.ПолучитьОбъект();
	//		НакладнаяОбъект.УстановитьСостояниеДокументов(Перечисления.СостояниеДокументов.ВнесеныИзменения,Неопределено,Истина);
	//		
	//	КонецЕсли ;
	//КонецЦикла; 	
	//нечаева 12,12,16--  не меняем  больше
	
	
КонецПроцедуры

//крохин начало 05.06.2019
Процедура ОбработкаЗаполнения(Основание) 	Экспорт 
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
//крохин конец 05.06.2019	
	ВидОснования = Основание.Метаданные().Имя;
	
	ИБ			 = Основание.ИБ; 
	ДокументОснования = основание;
	
	Если ВидОснования = "РасходнаяНакладная" Тогда				
		Контрагент   = Основание.Контрагент;
		Договор 	 = Основание.Договор;		
		
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;		
		ДокументОснование  = Основание.ссылка;
		
		СтрокаТЧ=Накладные.Найти(Основание,"Накладная");
		Если СтрокаТЧ=Неопределено Тогда
			СтрокаТЧ=Накладные.Добавить();
			СтрокаТЧ.Накладная=Основание;			
		КонецЕсли;
	ИначеЕсли ВидОснования = "КорректировкаЦенВНакладной" Тогда				
		Контрагент   = Основание.Корреспондент;
		Договор 	 = Основание.Договор;		
		
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;		
		ДокументОснование  =Основание.ДокОснование.ссылка;
	
		СтрокаТЧ=Накладные.Найти(Основание,"Накладная");
		Если СтрокаТЧ=Неопределено Тогда
			СтрокаТЧ=Накладные.Добавить();
			СтрокаТЧ.Накладная=Основание;			
		КонецЕсли;
	ИначеЕсли ВидОснования = "РекламационнаяНакладная" Тогда
		
		Контрагент   = Основание.Корреспондент;
		Договор 	 = Основание.Договор;		
		
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;
		
		Если ЗначениеЗаполнено(Основание.ДокОснование) Тогда
			ДокументОснование = Основание.ДокОснование;
		КонецЕсли;
		
		СтрокаТЧ=Накладные.Найти(Основание,"Накладная");
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = Накладные.Добавить();
			СтрокаТЧ.Накладная = Основание;			
		КонецЕсли;
	//Валетов + 10,12,2025 SNL-72  
		Если ЗначениеЗаполнено(Основание.ДокОснование) И ТипЗнч(Основание.ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Поставщику = Истина;
		КонецЕсли; 
	ИначеЕсли ВидОснования = "ПриходнаяНакладная" Тогда				
		Контрагент   = Основание.Контрагент;
		Договор 	 = Основание.Договор;		
		
		Валюта		 = Основание.Валюта;	
		Курс		 = Основание.Курс;
		
		Организация	 = ?(Основание.Склад.Организация.Пустая(),Основание.Организация,Основание.Склад.Организация);		
		Склад		 = Основание.Склад;		
		ДокументОснование  = Основание.ссылка;
		
		СтрокаТЧ=Накладные.Найти(Основание,"Накладная");
		Если СтрокаТЧ=Неопределено Тогда
			СтрокаТЧ=Накладные.Добавить();
			СтрокаТЧ.Накладная=Основание;			
		КонецЕсли;  
		Поставщику = Истина;
		//Валетов -
	КонецЕсли;	
	
	Для Каждого СтрокаТЧ Из Накладные Цикл
		РасчетСтроки(СтрокаТЧ);	
	КонецЦикла; 
	
КонецПроцедуры
